probonopd/Synth_Dexed/esp32/main/step_sequencer.cpp
    /* 3. At bar start (step 0): turn off previous bar chord, play new one for legato across bar */
    if (step == 0 && s->playing && s->held_chord.active) {
        /* Turn off previous bar chord notes */
        for (int i = 0; i < s->bar_chord_note_count; i++) {
            if (s->bar_chord_notes[i].active) {
                dexed_raw_handle_midi(0x80, s->bar_chord_notes[i].note, 0);
                s->bar_chord_notes[i].active = false;
            }
        }
        s->bar_chord_note_count = 0;

        /* Play new bar chord notes (legato — will sustain until next bar) */
        uint8_t chord_root = s->held_chord.chord_root;
        chord_type_t chord_type = s->held_chord.chord_type;
        uint16_t mask = chord_masks[chord_type];
        uint8_t base_note = (s->base_octave + 3) * 12 + chord_root;

        for (int i = 0; i < 12 && s->bar_chord_note_count < 12; i++) {
            if ((mask >> i) & 1) {
                uint8_t note = base_note + i;
                if (note <= 127) {
                    dexed_raw_handle_midi(0x90, note, 100);  /* 100 = mf velocity */
                    s->bar_chord_notes[s->bar_chord_note_count].note = note;
                    s->bar_chord_notes[s->bar_chord_note_count].active = true;
                    s->bar_chord_note_count++;
                }
            }
        }
    }

    /* 4. Trigger notes at current step */
    if (s->mode == SEQ_MODE_DRUM || s->mode == SEQ_MODE_BOTH) {
        for (int d = 0; d < SEQ_NUM_DRUM_TRACKS; d++) {
            uint8_t vel = s->drum_tracks[d].steps[step].velocity;
            if (vel > 0 && s->active_note_count < SEQ_ACTIVE_NOTES_MAX) {
                uint8_t note = drum_midi_notes[d];
                seq_drum_note_on(note, vel);
                s->active_notes[s->active_note_count].note = note;
                s->active_notes[s->active_note_count].channel =
                    tsf_engine_is_loaded() ? SEQ_CH_TSF : SEQ_CH_DEX;
                s->active_note_count++;
            }
        }
    }
    if (s->mode == SEQ_MODE_MELODIC || s->mode == SEQ_MODE_BOTH) {
        seq_melodic_step_t *ms = &s->melodic_steps[step];
        for (int n = 0; n < ms->note_count && s->active_note_count < SEQ_ACTIVE_NOTES_MAX; n++) {
            if (ms->notes[n] > 0) {
                dexed_raw_handle_midi(0x90, ms->notes[n], ms->velocities[n]);
                s->active_notes[s->active_note_count].note = ms->notes[n];
                s->active_notes[s->active_note_count].channel = 0;
                s->active_note_count++;
            }
        }
    }

    portEXIT_CRITICAL(&s->mux);

    /* 5. Update Launchpad display (outside critical section) */
    if (launchpad_is_connected()) {
        launchpad_refresh_grid();
    }
}

/* ================================================
 * Public API: init / deinit
 * ================================================ */

int step_seq_init(void)
{
    memset(&s_seq, 0, sizeof(s_seq));
    s_seq.mux = portMUX_INITIALIZER_UNLOCKED;
    s_seq.bpm = SEQ_DEFAULT_BPM;
    s_seq.num_steps = SEQ_MAX_STEPS;
    s_seq.current_step = -1;
    s_seq.current_velocity = SEQ_DEFAULT_VELOCITY;
    s_seq.base_octave = 3;  /* C3 = MIDI 60 */

    /* Initialize harmonic state */
    s_seq.harmonic.key = 0;         /* C */
    s_seq.harmonic.chord_root = 0;  /* Tonic */
    s_seq.harmonic.chord_type = CHORD_MAJ;
    s_seq.harmonic.scale_type = SCALE_MAJOR;
    s_seq.harmonic.tension = 0;
    s_seq.harmonic.prev_chord_root = 0;
    s_seq.harmonic.prev_chord_type = CHORD_MAJ;
    s_seq.harmonic.has_prev_chord = false;

    /* Initialize held chord tracking */
    s_seq.held_chord.chord_root = 0;
    s_seq.held_chord.chord_type = CHORD_MAJ;
    s_seq.held_chord.active = false;
    s_seq.held_chord.bar_chord_played = false;

    /* Initialize field notes tracking */
    for (int i = 0; i < 64; i++) {
        s_seq.field_notes[i].note = 0;
        s_seq.field_notes[i].active = false;
    }

    esp_timer_create_args_t timer_args = {
        .callback = seq_timer_callback,
        .arg = &s_seq,
        .dispatch_method = ESP_TIMER_TASK,
        .name = "step_seq",
        .skip_unhandled_events = true,
    };

    esp_err_t err = esp_timer_create(&timer_args, &s_seq.timer);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "Failed to create sequencer timer: %s", esp_err_to_name(err));
        return -1;
    }

    launchpad_init();

    ESP_LOGI(TAG, "Step sequencer initialized (BPM=%d, steps=%d)",
             s_seq.bpm, s_seq.num_steps);
    return 0;
}

void step_seq_deinit(void)
{
    step_seq_stop();
    if (s_seq.timer) {
        esp_timer_delete(s_seq.timer);
        s_seq.timer = NULL;
    }
}

/* ================================================
 * Transport
 * ================================================ */

void step_seq_play(void)
{
    if (s_seq.playing) return;
    s_seq.playing = true;
    s_seq.current_step = -1;  /* will advance to 0 on first tick */
    uint64_t period = step_period_us(s_seq.bpm);
    esp_timer_start_periodic(s_seq.timer, period);
    ESP_LOGI(TAG, "Sequencer started (BPM=%d, period=%llu us)",
             s_seq.bpm, (unsigned long long)period);

    if (launchpad_is_connected()) {
        launchpad_refresh_grid();
    }
}

void step_seq_stop(void)
{
    if (!s_seq.playing) return;
    esp_timer_stop(s_seq.timer);
    s_seq.playing = false;

    /* All notes off */
    portENTER_CRITICAL(&s_seq.mux);
    for (int i = 0; i < s_seq.active_note_count; i++) {
        seq_note_off_routed(s_seq.active_notes[i].channel, s_seq.active_notes[i].note);
    }
    s_seq.active_note_count = 0;
    
    /* Turn off bar chord notes */
    for (int i = 0; i < s_seq.bar_chord_note_count; i++) {
        if (s_seq.bar_chord_notes[i].active) {
            dexed_raw_handle_midi(0x80, s_seq.bar_chord_notes[i].note, 0);
            s_seq.bar_chord_notes[i].active = false;
        }
    }
    s_seq.bar_chord_note_count = 0;
    
    s_seq.current_step = -1;
    portEXIT_CRITICAL(&s_seq.mux);

    ESP_LOGI(TAG, "Sequencer stopped");

