probonopd/Synth_Dexed/esp32/main/step_sequencer.cpp
void step_seq_handle_button(uint8_t cc, uint8_t value)
{
    switch (cc) {
        case LP_CC_SESSION:
            if (value > 0) step_seq_toggle_play();
            break;

        case LP_CC_DRUMS:
            if (value > 0) {
                /* Press DRUMS button */
                if (s_seq.keys_btn_held) {
                    /* KEYS is already held → enter/toggle BOTH */
                    if (s_seq.mode == SEQ_MODE_BOTH) {
                        /* Already in BOTH, exit to MELODIC (KEYS is held) */
                        step_seq_set_mode(SEQ_MODE_MELODIC);
                    } else {
                        /* Enter BOTH */
                        step_seq_set_mode(SEQ_MODE_BOTH);
                    }
                } else {
                    /* KEYS not held → enter DRUM only */
                    step_seq_set_mode(SEQ_MODE_DRUM);
                }
            }
            s_seq.drums_btn_held = (value > 0);
            break;

        case LP_CC_KEYS:
            if (value > 0) {
                /* Press KEYS button */
                if (s_seq.drums_btn_held) {
                    /* DRUMS is already held → enter/toggle BOTH */
                    if (s_seq.mode == SEQ_MODE_BOTH) {
                        /* Already in BOTH, exit to DRUM (DRUMS is held) */
                        step_seq_set_mode(SEQ_MODE_DRUM);
                    } else {
                        /* Enter BOTH */
                        step_seq_set_mode(SEQ_MODE_BOTH);
                    }
                } else {
                    /* DRUMS not held → enter MELODIC only */
                    step_seq_set_mode(SEQ_MODE_MELODIC);
                }
            }
            s_seq.keys_btn_held = (value > 0);
            break;

        case LP_CC_UP:
            if (value > 0) step_seq_adjust_bpm(+5);
            break;

        case LP_CC_DOWN:
            if (value > 0) step_seq_adjust_bpm(-5);
            break;

        case LP_CC_LEFT:
            if (value > 0) step_seq_page_left();
            break;

        case LP_CC_RIGHT:
            if (value > 0) step_seq_page_right();
            break;

        /* ---- Right column buttons: mode selection ---- */
        case LP_CC_MODE_SEQ:
            if (value > 0) {
                /* Stop any held chord when switching away from Circle mode */
                if (s_seq.held_chord.active) {
                    stop_chord(s_seq.held_chord.chord_root, s_seq.held_chord.chord_type,
                               s_seq.base_octave + 3);
                    s_seq.held_chord.active = false;
                }
                /* Return to step sequencer (Drum mode default) */
                step_seq_set_mode(SEQ_MODE_DRUM);
                ESP_LOGI(TAG, "Mode: Step Sequencer");
            }
            break;

        case LP_CC_MODE_CIRCLE:
            if (value > 0) {
                /* Initialize held chord tracking when entering Circle mode */
                s_seq.held_chord.active = false;
                step_seq_set_mode(SEQ_MODE_CIRCLE);
                ESP_LOGI(TAG, "Mode: Circle of Fifths");
            }
            break;

        case LP_CC_MODE_FIELD:
            if (value > 0) {
                /* Do NOT stop the held chord when switching to Field mode.
                 * This allows melody to play "over" the harmony.
                 * The chord sustains until explicitly toggled off or changed.
                 */
                step_seq_set_mode(SEQ_MODE_FIELD);
                ESP_LOGI(TAG, "Mode: Melodic Field (chord sustains)");
            }
            break;

        case LP_CC_KEY_SELECT:
            if (value > 0) {
                /* Cycle through keys: C, C#, D, ... B */
                uint8_t new_key = (s_seq.harmonic.key + 1) % 12;
                step_seq_set_key(new_key);
                ESP_LOGI(TAG, "Key: %s", note_names[new_key]);
            }
            break;

        case LP_CC_SCALE_SELECT:
            if (value > 0) {
                /* Cycle through scale types */
                scale_type_t new_scale = (scale_type_t)((s_seq.harmonic.scale_type + 1) % SCALE_TYPE_COUNT);
                step_seq_set_scale(new_scale);
            }
            break;

        case LP_CC_TENSION:
            if (value > 0) {
                /* Cycle tension 0-3 */
                uint8_t new_tension = (s_seq.harmonic.tension + 1) % 4;
                step_seq_set_tension(new_tension);
            }
            break;

        case LP_CC_CLEAR:
            if (value > 0) {
                /* Stop any held chord first */
                if (s_seq.held_chord.active) {
                    stop_chord(s_seq.held_chord.chord_root, s_seq.held_chord.chord_type,
                               s_seq.base_octave + 3);
                    s_seq.held_chord.active = false;
                }
                /* Turn off bar chord notes */
                portENTER_CRITICAL(&s_seq.mux);
                for (int i = 0; i < s_seq.bar_chord_note_count; i++) {
                    if (s_seq.bar_chord_notes[i].active) {
                        dexed_raw_handle_midi(0x80, s_seq.bar_chord_notes[i].note, 0);
                        s_seq.bar_chord_notes[i].active = false;
                    }
                }
                s_seq.bar_chord_note_count = 0;
                portEXIT_CRITICAL(&s_seq.mux);
                
                /* Reset harmonic state to defaults */
                s_seq.harmonic.key = 0;
                s_seq.harmonic.chord_root = 0;
                s_seq.harmonic.chord_type = CHORD_MAJ;
                s_seq.harmonic.scale_type = SCALE_MAJOR;
                s_seq.harmonic.tension = 0;
                s_seq.harmonic.prev_chord_root = 0;
                s_seq.harmonic.prev_chord_type = CHORD_MAJ;
                s_seq.harmonic.has_prev_chord = false;
                ESP_LOGI(TAG, "Harmonic state reset");
            }
            break;

        default:
            break;
    }

    if (launchpad_is_connected()) {
        launchpad_refresh_grid();
    }
}

/* ================================================
 * Public API wrappers for display / launchpad use
 * ================================================ */

uint8_t step_seq_get_suggestion_score(uint8_t to_root)
{
    if (!s_seq.harmonic.has_prev_chord) {
        /* No previous chord — fall back to relationship to key */
        int dist = circle_distance(to_root, s_seq.harmonic.key);
        if (dist == 0) return 5;
        if (dist <= 1) return 4;
        if (dist <= 2) return 3;
        return 1;
    }
    return compute_suggestion(s_seq.harmonic.prev_chord_root, to_root, &s_seq.harmonic);
}

uint8_t step_seq_get_field_note(uint8_t row, uint8_t col)
{
    return get_field_note(row, col, &s_seq.harmonic);
}

bool step_seq_is_chord_tone(uint8_t pitch_class, uint8_t chord_root, chord_type_t type)
{
    return is_chord_tone(pitch_class, chord_root, type);
}

bool step_seq_is_scale_tone(uint8_t pitch_class, uint8_t key, scale_type_t scale)
{
    return is_scale_tone(pitch_class, key, scale);
}

void step_seq_get_circle_chord(uint8_t row, uint8_t col, uint8_t* out_root, chord_type_t* out_type)
{
    get_circle_chord(row, col, s_seq.harmonic.key, out_root, out_type);
}